#+HUGO_BASE_DIR: ../blog
** Cartesian Product 
  :PROPERTIES:
  :EXPORT_FILE_NAME: cartesian-product
  :EXPORT_DATE: <2018-03-29 Thu>
  :EXPORT_HUGO_DRAFT: false
  :EXPORT_HUGO_CATEGORIES: lisp
  :EXPORT_HUGO_TAGS: elisp common-lisp mapcan mapcar
  :END:

A question came up about how to compute the cross-product of sets. Take this example, we want to turn this:

#+BEGIN_EXAMPLE
((chocolate strawberry) (sprinkle oreo))
#+END_EXAMPLE

Into this:

#+BEGIN_EXAMPLE
((chocolate sprinkle) (chocolate oreo) (strawberry sprinkle) (strawberry oreo))
#+END_EXAMPLE

Take some time to think about you might solve it.

#+BEGIN_EXPORT html
<hr />
#+END_EXPORT

Okay, now that you've thought some about it let's look at one solution. Shout out to /capablemonkey/ on Github for providing the code. 

#+BEGIN_SRC emacs-lisp
;; https://gist.github.com/capablemonkey/4133438ba7043af94691a2b54d997e8b
(defun cartesian-product (a b)
  (mapcan
    (lambda (item-from-a)
      (mapcar
        (lambda (item-from-b)
          (if (listp item-from-a)
            (append item-from-a (list item-from-b))
            (list item-from-a item-from-b)))
        b))
    a))
#+END_SRC

Each function shown above has a definition following so you can understand what's going on after studying a bit.

Let's look at `mapcan`.

*mapcan* :: mapcan is like mapcar, except that the results of applying function are combined into a list by the use of nconc rather than list.

*nconc* (called from within mapcan) ::  Returns a list that is the concatenation of lists. If no lists are supplied, (nconc) returns nil.

  Here's an example that hopefully clears up /nconc/.

  #+BEGIN_SRC elisp
  (nconc '(1) nil '(2) nil) ;;=> (1 2)
  #+END_SRC


*lambda* :: the result of evaluating the lambda expression is the expression itself.  The lambda expression may then be treated as a function, i.e., stored as the function value of a symbol, passed to ‘mapcar’, etc.

#+BEGIN_SRC emacs-lisp
  (mapcan
   (lambda (item-from-a)
     ...
     )
   a)
#+END_SRC


Then we use _*mapcar*_...

*mapcar* :: [[http://www.lispworks.com/documentation/HyperSpec/Body/f_mapc_.htm#mapcon][mapcar]] operates on successive elements of the lists. function is applied to the first element of each list, then to the second element of each list, and so on. The iteration terminates when the shortest list runs out, and excess elements in other lists are ignored. The value returned by mapcar is a list of the results of successive calls to function. 


#+BEGIN_SRC emacs-lisp
(mapcar

(lambda (item-from-b)
  ...
)
b)
#+END_SRC


For each /item-from-b/, we ask if /item-from-a/ is a list. If so, append item-from-b onto item-from-a. Otherwise, make a list with /item-from-a/ and /item-from-b/.

*listp* :: Return t if OBJECT is a list, that is, a cons cell or nil. Otherwise, return nil.

*append* :: Concatenate all the arguments and make the result a list.

*list* :: Return a newly created list with specified arguments as elements. Any number of arguments, even zero arguments, are allowed.

#+BEGIN_SRC elisp
(if (listp item-from-a)
            (append item-from-a (list item-from-b))
            (list item-from-a item-from-b))
#+END_SRC

Let's try an example:

#+BEGIN_SRC emacs-lisp :results verbatim :exports both
(cartesian-product '(a b) '(c d)) 
#+END_SRC

#+RESULTS:
: ((a c) (a d) (b c) (b d))


We can support any number of lists by leveraging the *reduce* function.

#+BEGIN_SRC emacs-lisp
(reduce #'cartesian-product '((chocolate strawberry) (sprinkle oreo) (smoothie cake)))
#+END_SRC

#+BEGIN_EXAMPLE
((chocolate sprinkle smoothie) 
 (chocolate sprinkle cake) 
 (chocolate oreo smoothie) 
 (chocolate oreo cake) 
 (strawberry sprinkle smoothie) 
 (strawberry sprinkle cake) 
 (strawberry oreo smoothie) 
 (strawberry oreo cake))
#+END_EXAMPLE



LISP provides lots of useful tools that when put together become very delicious. I mean, powerful.
*** Programming a function to clock in 

#+BEGIN_SRC elisp
(org-id-find "empty-time-tracker")
#+END_SRC

#+BEGIN_QUOTE
org-id-find is an autoloaded compiled Lisp function in ‘org-id.el’.

(org-id-find ID &optional MARKERP)

Return the location of the entry with the id ID.
The return value is a cons cell (file-name . position), or nil
if there is no entry with that ID.
With optional argument MARKERP, return the position as a new marker.
#+END_QUOTE

Programatic clock in like this:

#+BEGIN_SRC elisp
(org-clock-in "empty-time-tracker")
#+END_SRC

#+BEGIN_QUOTE
org-clock-in is an interactive autoloaded compiled Lisp function in
‘org-clock.el’.

It is bound to C-c C-x TAB, <menu-bar> <Org> <Logging work> <Clock
in>.

(org-clock-in &optional SELECT START-TIME)

Start the clock on the current item.

If necessary, clock-out of the currently active clock.

With a ‘C-u’ prefix argument SELECT, offer a list of recently clocked
tasks to clock into.

When SELECT is ‘C-u C-u’, clock into the current task and mark it as
the default task, a special task that will always be offered in the
clocking selection, associated with the letter ‘d’.

When SELECT is ‘C-u C-u C-u’, clock in by using the last clock-out
time as the start time.  See ‘org-clock-continuously’ to make this
the default behavior.
#+END_QUOTE

Which yields a running clock on the given task ID. For example:

#+BEGIN_SRC org
,* Tracking unorganized time
:PROPERTIES:
:ID: empty-time-tracker
:END:
:LOGBOOK:
CLOCK: [2018-04-09 Mon 18:38]--[2018-04-09 Mon 19:02] =>  0:24
:END:
#+END_SRC

Here's what I came up with in a function:

#+BEGIN_SRC elisp
(lambda ()
  (if (not (org-clocking-p))
    (org-with-point-at (org-id-find "empty-time-tracker" 'marker)
      (org-clock-in "empty-time-tracker"))))
#+END_SRC

#+BEGIN_QUOTE
org-clocking-p is a compiled Lisp function in ‘org-clock.el’.

(org-clocking-p)

Return t when clocking a task.
#+END_QUOTE

#+BEGIN_QUOTE
org-with-point-at is a Lisp macro in ‘org-macs.el’.

(org-with-point-at POM &rest BODY)

Move to buffer and point of point-or-marker POM for the duration of BODY.
#+END_QUOTE
*** Major Scale

#+BEGIN_SRC elisp :exports both
(mapcar #'major-scale chromatic-scale)
#+END_SRC

#+RESULTS:
| C  | D  | E  | F  | G  | A  | B  | C  |
| C# | D# | F  | F# | G# | A# | C  | C# |
| D  | E  | F# | G  | A  | B  | C# | D  |
| D# | F  | G  | G# | A# | C  | D  | D# |
| E  | F# | G# | A  | B  | C# | D# | E  |
| F  | G  | A  | Bb | C  | D  | E  | F  |
| F# | G# | A# | B  | C# | D# | F  | F# |
| G  | A  | B  | C  | D  | E  | F# | G  |
| G# | A# | C  | C# | D# | F  | G  | G# |
| A  | B  | C# | D  | E  | F# | G# | A  |
| A# | C  | D  | D# | F  | G  | A  | A# |
| B  | C# | D# | E  | F# | G# | A# | B  |



Or we can generate the minor scales using the same technique:


*** Minor Scale

#+BEGIN_SRC elisp :exports both
(mapcar #'minor-scale chromatic-scale)
#+END_SRC

#+RESULTS:
| C  | D  | Eb | F  | G  | Ab | Bb | C  |
| C# | D# | E  | F# | G# | A  | B  | C# |
| D  | E  | F  | G  | A  | Bb | C  | D  |
| D# | F  | F# | G# | A# | B  | C# | D# |
| E  | F# | G  | A  | B  | C  | D  | E  |
| F  | G  | Ab | Bb | C  | Db | Eb | F  |
| F# | G# | A  | B  | C# | D  | E  | F# |
| G  | A  | Bb | C  | D  | Eb | F  | G  |
| G# | A# | B  | C# | D# | E  | F# | G# |
| A  | B  | C  | D  | E  | F  | G  | A  |
| A# | C  | C# | D# | F  | F# | G# | A# |
| B  | C# | D  | E  | F# | G  | A  | B  |




*** Pentatonic Minor Scale
#+BEGIN_SRC elisp :exports both
(mapcar #'pentatonic-minor-scale chromatic-scale)
#+END_SRC

#+RESULTS:
| C  | Eb | F  | G  | Bb |
| C# | E  | F# | G# | B  |
| D  | F  | G  | A  | C  |
| D# | F# | G# | A# | C# |
| E  | G  | A  | B  | D  |
| F  | Ab | Bb | C  | Eb |
| F# | A  | B  | C# | E  |
| G  | Bb | C  | D  | F  |
| G# | B  | C# | D# | F# |
| A  | C  | D  | E  | G  |
| A# | C# | D# | F  | G# |
| B  | D  | E  | F# | A  |

*** Pentatonic Major Scale
#+BEGIN_SRC elisp :exports both
(mapcar #'pentatonic-major-scale chromatic-scale)
#+END_SRC

#+RESULTS:
| C  | D  | E  | G  | A  |
| C# | D# | F  | G# | A# |
| D  | E  | F# | A  | B  |
| D# | F  | G  | A# | C  |
| E  | F# | G# | B  | C# |
| F  | G  | A  | C  | D  |
| F# | G# | A# | C# | D# |
| G  | A  | B  | D  | E  |
| G# | A# | C  | D# | F  |
| A  | B  | C# | E  | F# |
| A# | C  | D  | F  | G  |
| B  | C# | D# | F# | G# |


